UAS/OpenFoam/challenger_cases/nose_level/0/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HelyxOS                                                  |
|   o   O   o      | Version: v1.0.3                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    location 0;
    object U;
}

    boundaryField
    {
        ffminx
        {
            type freestream;
            value uniform (15.0 0.0 0.0 );
            phi phi;
            freestreamValue uniform (15.0 0.0 0.0 );
        }

        ffmaxx
        {
            type zeroGradient;
            value uniform (0 0 0);
        }

        ffminy
        {
            type fixedValue;
            value uniform ( 0 0 0);
        }

        ffmaxy
        {
            type fixedValue;
            value uniform ( 0 0 0);
        }

        ffminz
        {
            type fixedValue;
            value uniform ( 0 0 0);
        }

        ffmaxz
        {
            type fixedValue;
            value uniform ( 0 0 0);
        }

        challenger_level_solid0
        {
            type fixedValue;
            value uniform ( 0 0 0);
        }

    }

    dimensions [ 0 1 -1 0 0 0 0 ];
    internalField uniform (15.0 0.0 0.0 );