UAS/OpenFoam/challenger_cases/nose_level/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HelyxOS                                                  |
|   o   O   o      | Version: v1.0.3                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location 0;
    object p;
}

    boundaryField
    {
        ffminx
        {
            type freestreamPressure;
        }

        ffmaxx
        {
            type totalPressure;
            p0 uniform 0;
            value uniform 0;
            rho none;
            psi none;
            U U;
            phi phi;
            gamma 1;
        }

        ffminy
        {
            type zeroGradient;
        }

        ffmaxy
        {
            type zeroGradient;
        }

        ffminz
        {
            type zeroGradient;
        }

        ffmaxz
        {
            type zeroGradient;
        }

        challenger_level_solid0
        {
            type zeroGradient;
        }

    }

    dimensions [ 0 2 -2 0 0 0 0 ];
    internalField uniform 0;