UAS/OpenFoam/challenger_cases/nose_level/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HelyxOS                                                  |
|   o   O   o      | Version: v1.0.3                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location constant;
    object RASProperties;
}

    RASModel kEpsilon;
    turbulence on;
    printCoeffs on;
    kEpsilonCoeffs
    {
        fieldMaps
        {
            k k;
            epsilon epsilon;
            nut nut;
        }

        Cmu 0.09;
        C1 1.44;
        C2 1.92;
        alphaEps 0.76923;
    }
