UAS/OpenFoam/challenger_cases/nose_level/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HelyxOS                                                  |
|   o   O   o      | Version: v1.0.3                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location constant;
    object turbulenceProperties;
}

    simulationType RASModel;