UAS/OpenFoam/challenger_cases/nose_level/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HelyxOS                                                  |
|   o   O   o      | Version: v1.0.3                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object decomposeParDict;
}

    numberOfSubdomains 1;
    method hierarchical;
    hierarchicalCoeffs
    {
        n (1 1 1);
        delta 0.001;
        order yxz;
    }

    distributed false;
    roots
    (
    );